basicCaseMoving/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;


// L:length, H:height, W:width
L       |-L-|;
H       |-H/2-|;
W       |-W-|;
H2       |-H-|;
Ls       |-Ls-|;

vertices
(
    ( 0   0   0)
    ($L   0   0)
    ($L  $H   0)
    ($L $H2   0)
    ( 0 $H2   0)
    ( 0  $H   0)

    ( 0   0  $W)
    ($L   0  $W)
    ($L  $H  $W)
    ($L $H2  $W)
    ( 0 $H2  $W)
    ( 0  $H  $W)

//    ($Ls  0  0)
//    ($Ls  0  $W)


);

blocks
(
    hex ( 0  1  2  5  6  7  8 11) (|-nx-| |-int(ny/2)-| |-nz-|) simpleGrading (1 |-gradient-| 1)
    hex ( 5  2  3  4 11  8  9 10) (|-nx-| |-int(ny/2)-| |-nz-|) simpleGrading (1 |--gradient-| 1)
);

boundary
(
    bottom
    {
        type            wall;
        faces           ((0 6 7 1));
        matchTolerance  |-matchTolerance-|;
    }
    top
    {
        type            wall;
        faces           ((4 3 9 10));
        matchTolerance  |-matchTolerance-|;
    }
    
    
    <!--(if case=="spatial")-->
        inlet
        {
            type            patch;
            faces           ((0 5 11 6)(5 4 10 11));
        }
        outlet
        {
            type            patch;
            faces           ((1 7 8 2)(2 8 9 3));
        }
    <!--(else)-->
    
        <!--(if dynamicMesh=="sine_lower_wall")-->
            inlet
            {
                type            cyclicAMI;
                neighbourPatch  outlet;
                faces           ((0 5 11 6)(5 4 10 11));
                matchTolerance  |-matchTolerance-|;
                transform       translational;
                separationVector (|- L -| 0 0);
                AMI
                {
                    method          faceAreaWeight; // Ensures flux conservation
                    tolerance 1e-8;
                }
            }
            
            outlet
            {
                type            cyclicAMI;
                neighbourPatch  inlet;
                faces           ((1 7 8 2)(2 8 9 3));
                matchTolerance  |-matchTolerance-|;
                transform       translational;
                separationVector (|- -L -| 0 0);
                AMI
                {
                    method          faceAreaWeight; // Ensures flux conservation
                    tolerance 1e-8;
                }
            }
            left
            {
                type            cyclicAMI;
                neighbourPatch  right;
                faces           ((1 2 5 0)(2 3 4 5));
                matchTolerance  |-matchTolerance-|;
                transform       translational;
                separationVector (0 0 |- W -|);
                AMI
                {
                    method          faceAreaWeight; // Ensures flux conservation
                    tolerance 1e-8;
                }
            }
            right
            {
                type            cyclicAMI;
                neighbourPatch  left;
                faces           ((6 11 8 7)(11 10 9 8));
                matchTolerance  |-matchTolerance-|;
                transform       translational;
                separationVector (0 0 |- -W -|);
                AMI
                {
                    method          faceAreaWeight; // Ensures flux conservation
                    tolerance 1e-8;
                }
            }
        <!--(else)-->
            inlet
            {
                type            cyclic;
                neighbourPatch  outlet;
                faces           ((0 5 11 6)(5 4 10 11));
                matchTolerance  |-matchTolerance-|;
            }
            
            outlet
            {
                type            cyclic;
                neighbourPatch  inlet;
                faces           ((1 7 8 2)(2 8 9 3));
                matchTolerance  |-matchTolerance-|;
            }
            left
            {
                type            cyclic;
                neighbourPatch  right;
                faces           ((1 2 5 0)(2 3 4 5));
                matchTolerance  |-matchTolerance-|;
            }
            right
            {
                type            cyclic;
                neighbourPatch  left;
                faces           ((6 11 8 7)(11 10 9 8));
                matchTolerance  |-matchTolerance-|;
            }
            
        <!--(end)-->
    <!--(end)-->
);


// ************************************************************************* //
