basicCaseMoving/constant/dynamicMeshDict

/*--------------------------------*- C++ -*-------engine:jinja2---------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //





    // The lower wall moves with a sinusoidal waveform
    dynamicFvMesh dynamicMotionSolverFvMesh;
    
    motionSolverLibs (fvMotionSolvers overset);

    solver          displacementLaplacian;

    displacementLaplacianCoeffs
    {
        diffusivity     uniform 1;
    }




// ************************************************************************* //