basicCaseMoving/system/fvSolution
/*--------------------------------*- C++ -*-------------engine:jinja2---------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-05;
        relTol          0.01;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 1000;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(pFinal|pcorrFinal)"
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
    
    "(cellDisplacement|cellDisplacementFinal)"
    {
        solver          GAMG;
        tolerance       1e-5;
        relTol          0;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
}


  PIMPLE
  {
      nCorrectors              10;
      nOuterCorrectors         1;
      nNonOrthogonalCorrectors 5;
      pRefCell                  0;
      pRefValue                 0;

      residualControl
        {
            "(U|k|epsilon|omega)"
            {
                relTol          0;
                tolerance       0.001;
            }
        }
      
  }




// ************************************************************************* //