basicCaseMoving/system/FOmeanFields
/*--------------------------------*- C++ -*-------------engine:jinja2---------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |

|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Field average for all the previous values
    fieldAverage1
    {
        type                fieldAverage;
        libs                ("libfieldFunctionObjects.so");
        writeControl        writeTime;
        timeStart   200; // Start calculating averages at
        
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            wallShearStress
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            Cf
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }